#### Terraform Plan ('src/domains/selfcare/prod/westeurope') 📖
<details>
<summary>Terraform Plan</summary>

```hcl
module.app_services.data.azurerm_linux_function_app.itn_webapp_functions_app: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.devportal_be_apim_itn must be replaced
-/+ resource "azurerm_role_assignment" "devportal_be_apim_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/42d1d7ff-6848-b79e-fc26-4753d5cf5aa0" -> (known after apply)
      ~ name                                   = "42d1d7ff-6848-b79e-fc26-4753d5cf5aa0" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.devportal_be_apim_v2 must be replaced
-/+ resource "azurerm_role_assignment" "devportal_be_apim_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/e01b19d5-109f-027f-a720-61f0060b5a9c" -> (known after apply)
      ~ name                                   = "e01b19d5-109f-027f-a720-61f0060b5a9c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_devportalservicedata_itn must be replaced
-/+ resource "azurerm_role_assignment" "function_devportalservicedata_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/c076175c-83aa-ffa5-f254-445ce39c4279" -> (known after apply)
      ~ name                                   = "c076175c-83aa-ffa5-f254-445ce39c4279" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_devportalservicedata_staging_slot_itn must be replaced
-/+ resource "azurerm_role_assignment" "function_devportalservicedata_staging_slot_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/20646bc7-c876-cb3d-bbcb-bacc73e9596e" -> (known after apply)
      ~ name                                   = "20646bc7-c876-cb3d-bbcb-bacc73e9596e" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_devportalservicedata_staging_slot_v2 must be replaced
-/+ resource "azurerm_role_assignment" "function_devportalservicedata_staging_slot_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/ae18bcc1-0805-a9d4-bd66-1d6568b9b3d6" -> (known after apply)
      ~ name                                   = "ae18bcc1-0805-a9d4-bd66-1d6568b9b3d6" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_devportalservicedata_v2 must be replaced
-/+ resource "azurerm_role_assignment" "function_devportalservicedata_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/071a89d0-50af-68e6-f8c2-0acda8a12d31" -> (known after apply)
      ~ name                                   = "071a89d0-50af-68e6-f8c2-0acda8a12d31" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_subscriptionmigrations_itn must be replaced
-/+ resource "azurerm_role_assignment" "function_subscriptionmigrations_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/9ac51d53-1b78-7510-0997-a87ef22bbbee" -> (known after apply)
      ~ name                                   = "9ac51d53-1b78-7510-0997-a87ef22bbbee" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_subscriptionmigrations_staging_slot_itn must be replaced
-/+ resource "azurerm_role_assignment" "function_subscriptionmigrations_staging_slot_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/38e18903-c6fc-04da-db28-7a052a1185d7" -> (known after apply)
      ~ name                                   = "38e18903-c6fc-04da-db28-7a052a1185d7" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_subscriptionmigrations_staging_slot_v2 must be replaced
-/+ resource "azurerm_role_assignment" "function_subscriptionmigrations_staging_slot_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/799f86e2-4bfe-763b-7136-6a723eeb49b8" -> (known after apply)
      ~ name                                   = "799f86e2-4bfe-763b-7136-6a723eeb49b8" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.function_subscriptionmigrations_v2 must be replaced
-/+ resource "azurerm_role_assignment" "function_subscriptionmigrations_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/4e35cacc-9681-6e16-32f0-7a6ad79a8b73" -> (known after apply)
      ~ name                                   = "4e35cacc-9681-6e16-32f0-7a6ad79a8b73" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.selfcare_be_apim_itn must be replaced
-/+ resource "azurerm_role_assignment" "selfcare_be_apim_itn" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/694f64ae-03d4-e0c1-fa2b-9bd77a095ad5" -> (known after apply)
      ~ name                                   = "694f64ae-03d4-e0c1-fa2b-9bd77a095ad5" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.selfcare_be_apim_v2 must be replaced
-/+ resource "azurerm_role_assignment" "selfcare_be_apim_v2" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/providers/Microsoft.Authorization/roleAssignments/cab0f149-e784-d3d4-1255-f5bb98b21349" -> (known after apply)
      ~ name                                   = "cab0f149-e784-d3d4-1255-f5bb98b21349" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e022efe7-f5ba-4159-bbe4-b44f577e9b61" -> (known after apply)
      ~ role_definition_name                   = "API Management Service Operator Role" -> "PagoPA API Management Operator App" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.app_services.module.selfcare_jwt.azurerm_key_vault_secret.jwt_cert will be updated in-place
  ~ resource "azurerm_key_vault_secret" "jwt_cert" {
        id                      = "https://io-p-kv-common.vault.azure.net/secrets/selfcare-jwt-cert/4c7cc906c39f4de7900b5f3756a633d4"
        name                    = "selfcare-jwt-cert"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.app_services.module.selfcare_jwt.tls_self_signed_cert.jwt_self must be replaced
-/+ resource "tls_self_signed_cert" "jwt_self" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDWzCCAkOgAwIBAgIRAMR7Rjfee0k53F5R9xpyew4wDQYJKoZIhvcNAQELBQAw
            WDEJMAcGA1UEBhMAMQkwBwYDVQQIEwAxCTAHBgNVBAcTADEJMAcGA1UEERMAMQkw
            BwYDVQQKEwAxCTAHBgNVBAsTADEUMBIGA1UEAxMLSU8gc2VsZmNhcmUwHhcNMjMx
            MTIzMTcwOTIyWhcNMjQxMTE3MTcwOTIyWjBYMQkwBwYDVQQGEwAxCTAHBgNVBAgT
            ADEJMAcGA1UEBxMAMQkwBwYDVQQREwAxCTAHBgNVBAoTADEJMAcGA1UECxMAMRQw
            EgYDVQQDEwtJTyBzZWxmY2FyZTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoC
            ggEBALcVjp4Igj5Ohmc4tKgvR6QlRzfpvNLLManh4FoHaCtiS4uPIqGu3IhG/aAq
            0nl4/4uuIwAcXhjy6vgbRncwcwDEUHdOVhLlLn9Qewf+RzoKCUvnSNS8q476Rt0g
            lla48quP2BAinW/v6t646Abh2+8TeKqZbKN1FNC/7xw9fdU4WPAquykZ6f7C4Lkj
            T1wPDK7jrXY2N+Sg+GX+7Awn5csqKEoezh8AX4evmh899Y2J5rt8eSIa8ibT5zav
            3WuFud9fEUSnZXJ+5hBNuj1FLnm9o4MaHHzZt5azFbHVwYgu31zMu+EEgdKEvIvr
            DorBxOrjErWM55KNOLv5UNr5Js8CAwEAAaMgMB4wDgYDVR0PAQH/BAQDAgeAMAwG
            A1UdEwEB/wQCMAAwDQYJKoZIhvcNAQELBQADggEBABAjiszFWFSa2aCP+qnXiamH
            06oOnY7iN9DFmyFaplpz5JddQtieSujUYzApnxOCDKyNpaJC8bYzLYadLDVOIIqE
            GSpLV64jlpv4yvoM7BFmOa7FnhAbQAOhQrBSd48HdYkpllpaQVpW2RA2yrCB+RVU
            Uy4eAmdS9SXWS8qSGedVudgFpAO2wpv+u9L0MJ4A8x0L11Rqyn4pdwx9iBit+ZBj
            XCqgjv2JHB7ak3v7w28CTBwFtH4Pa09x8nV7Nnd1v9vZslL49cwcUwz7SQTlZAnb
            QA838TOpzz/AGXVGKPtIKNyVb1V1zaQw90lzolFAoDnZskcJf38T9GjyVaGDEng=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "261168763882519204645171764604781624078" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ ready_for_renewal     = true -> false # forces replacement
      ~ validity_end_time     = "2024-11-17T17:09:22.924416878Z" -> (known after apply)
      ~ validity_start_time   = "2023-11-23T17:09:22.924416878Z" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 13 to add, 1 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
